Revit 2026 API

# AlternateUnits Enumeration

---

An enumerated type listing the locations where Alternate units may be displayed in dimensions.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum AlternateUnits
```
```vb
Public Enumeration AlternateUnits
```
```cpp
public enum class AlternateUnits
```
```fsharp
type AlternateUnits
```

| Member name | Value | Description |
| --- | --- | --- |
| Below | 2 | Alternative units display below the primary units. |
| None | 0 | No alternative units. |
| Right | 1 | Alternative units display to the right of the primary units. |

#### Reference

Autodesk.Revit.DB Namespace